# # [作業3]
# 
# 想像你經營一個自由載客車隊，你希望能透過數據分析以提升業績，請你思考並描述你如何規劃整體的分析/解決方案：
# 
# 1. 核心問題為何 (tips：如何定義 「提升業績 & 你的假設」)
# 
# 2. 資料從何而來 (tips：哪些資料可能會對你想問的問題產生影響 & 資料如何蒐集)
# 
# 3. 蒐集而來的資料型態為何
# 
# 4. 你要回答的問題，其如何評估 (tips：你的假設如何驗證)
#
# A1 : 如何提升載客率、如何提升客戶黏著度、如何讓正在使用其他載客車隊的客戶轉向我們、如何開發不常使用載客服務的客群
#      如何利用數據進行定價、如何基於數據來管理整個車隊
#
# A2 : 資料從內部過去的載客資料蒐集(比如說 : 如果有app的話，蒐集各個帳號的年齡、性別、工作、常出現的地方等資料)，
#      問卷調查、買資料、其他資料(視個別的case去爬)
#
# A3 : 看標籤，部分是連續的資料，部分是離散的資料，我們也可以視情況把連續的資料作離散化
#
# A4 : 看上述的核心問題有沒有被解決、公司的業績是否有有效提升、知名度是否有提升、註冊人數是否變多

